<b>PANDAS

In [1]:
import pandas as pd
import numpy as np

In [2]:
pd.__version__

'1.3.5'

<b>Dictionary to Series

In [3]:
my_d = {"one" : [1,2,3,4], "two" : [6,7,8,9]}
print(my_d)
print(type(my_d))

{'one': [1, 2, 3, 4], 'two': [6, 7, 8, 9]}
<class 'dict'>

In [4]:
series_my_d = pd.Series(my_d)
print(type(series_my_d))
print(series_my_d)

<class 'pandas.core.series.Series'>
one    [1, 2, 3, 4]
two    [6, 7, 8, 9]
dtype: object

<b>Numpy RANDOM array to Series

In [5]:
b1 = np.random.randint(60, size = 10) #Range = 60, size = 10
print(type(b1))
print("b1= ",b1)

<class 'numpy.ndarray'>
b1=  [ 8 57 48 46 38 58  8 11 47 14]

In [6]:
b1s = pd.Series(b1)
print(type(b1s))
print(b1s)

<class 'pandas.core.series.Series'>
0     8
1    57
2    48
3    46
4    38
5    58
6     8
7    11
8    47
9    14
dtype: int32

In [7]:
b2 = np.random.randint(60, size = 5)
#Give your own index
b2s = pd.Series(b2, index = ['a','b','c','d','e'])
print(b2s)

a    31
b    45
c    11
d    53
e    19
dtype: int32

In [8]:
print(b1s[5])
print(b2s['c'])

58
11

<b>DATAFRAME

In [9]:
d = {"id" : [1,2,3,4,5], "name": ['a','b','c','d','e']}
print(type(d))
print(d,"\n")

<class 'dict'>
{'id': [1, 2, 3, 4, 5], 'name': ['a', 'b', 'c', 'd', 'e']}

In [10]:
df_d = pd.DataFrame(d)
print(type(df_d))
df_d

<class 'pandas.core.frame.DataFrame'>

   id name
0   1    a
1   2    b
2   3    c
3   4    d
4   5    e

In [11]:
#Get all column names
df_d.columns

Index(['id', 'name'], dtype='object')

In [12]:
#Get data types of all columns
df_d.dtypes

id       int64
name    object
dtype: object

In [13]:
s1 = pd.Series(['A','B','C','D','E'], name = 'Section')
s2 = pd.Series([99,78,98,87,67], name = 'Avergae Marks')
s3 = pd.Series([30,29,28,31,32], name = 'Number of students')

List = [s1,s2,s3] #List of series
print(List)

[0    A
1    B
2    C
3    D
4    E
Name: Section, dtype: object, 0    99
1    78
2    98
3    87
4    67
Name: Avergae Marks, dtype: int64, 0    30
1    29
2    28
3    31
4    32
Name: Number of students, dtype: int64]

In [14]:
df = pd.DataFrame(List)
df

                     0   1   2   3   4
Section              A   B   C   D   E
Avergae Marks       99  78  98  87  67
Number of students  30  29  28  31  32

In [15]:
df.T

  Section Avergae Marks Number of students
0       A            99                 30
1       B            78                 29
2       C            98                 28
3       D            87                 31
4       E            67                 32

<b>Reading files using pandas

In [16]:
df = pd.read_csv('students.csv')
df

   id    name  quiz1  quiz2  assignment  midsem  compre
0   1  pravin      5      5          10      22      34
1   2   patil      5      5          10       2       4
2   3    john      3      3           5      11      33
3   4   sadiq      5      5           5      23      11
4   5  pravin      5      5          10      22      34

In [17]:
type(df)

pandas.core.frame.DataFrame

In [18]:
df_e = pd.read_excel('students.xlsx')
df_e

   id name  q1  assign  mid  compre
0   1    A   5      10    5      35
1   2    B   4       9   23      21
2   3    C   3       6   12      23
3   4    D   4       2   23      23
4   5    E   1       7   11      11

In [19]:
print(type(df_e))

<class 'pandas.core.frame.DataFrame'>

<b>Changing type of file and saving back

In [20]:
df_e.to_csv('MyNewCSVfromExcel.csv')

In [21]:
df

   id    name  quiz1  quiz2  assignment  midsem  compre
0   1  pravin      5      5          10      22      34
1   2   patil      5      5          10       2       4
2   3    john      3      3           5      11      33
3   4   sadiq      5      5           5      23      11
4   5  pravin      5      5          10      22      34

In [24]:
#Read single column from DF (series)

n = df['name']
print(type(n))
print("First way:\n",n,"\n")
print("Second way:\n",df.name,"\n")

<class 'pandas.core.series.Series'>
First way:
 0    pravin
1     patil
2      john
3     sadiq
4    pravin
Name: name, dtype: object

Second way:
 0    pravin
1     patil
2      john
3     sadiq
4    pravin
Name: name, dtype: object

In [27]:
#Read multiple columns from DF (creates a DF)

l_of_cols = ['name', 'quiz1', 'quiz2']
new_df = df[l_of_cols]
print("type: ", type(new_df))
new_df

type:  <class 'pandas.core.frame.DataFrame'>

     name  quiz1  quiz2
0  pravin      5      5
1   patil      5      5
2    john      3      3
3   sadiq      5      5
4  pravin      5      5

In [28]:
df.head()

   id    name  quiz1  quiz2  assignment  midsem  compre
0   1  pravin      5      5          10      22      34
1   2   patil      5      5          10       2       4
2   3    john      3      3           5      11      33
3   4   sadiq      5      5           5      23      11
4   5  pravin      5      5          10      22      34

In [29]:
df.head(2)

   id    name  quiz1  quiz2  assignment  midsem  compre
0   1  pravin      5      5          10      22      34
1   2   patil      5      5          10       2       4

In [30]:
df.tail(2)

   id    name  quiz1  quiz2  assignment  midsem  compre
3   4   sadiq      5      5           5      23      11
4   5  pravin      5      5          10      22      34

In [31]:
df.iloc[0] #Index Location

id                 1
name          pravin
quiz1              5
quiz2              5
assignment        10
midsem            22
compre            34
Name: 0, dtype: object

In [35]:
df.iloc[0,0]

1

In [36]:
df.iloc[0,1]

'pravin'

In [37]:
df.loc[0,"name"] #Location

'pravin'

<b>Queries

In [40]:
df

   id    name  quiz1  quiz2  assignment  midsem  compre
0   1  pravin      5      5          10      22      34
1   2   patil      5      5          10       2       4
2   3    john      3      3           5      11      33
3   4   sadiq      5      5           5      23      11
4   5  pravin      5      5          10      22      34

In [39]:
df[df.midsem > 15]

   id    name  quiz1  quiz2  assignment  midsem  compre
0   1  pravin      5      5          10      22      34
3   4   sadiq      5      5           5      23      11
4   5  pravin      5      5          10      22      34

In [42]:
df[ (df.quiz1 > 3) & (df.compre > 32)]

   id    name  quiz1  quiz2  assignment  midsem  compre
0   1  pravin      5      5          10      22      34
4   5  pravin      5      5          10      22      34

In [43]:
#query method

df.query('quiz1>3 & compre>32')

   id    name  quiz1  quiz2  assignment  midsem  compre
0   1  pravin      5      5          10      22      34
4   5  pravin      5      5          10      22      34

<b>Data Exploratory Analysis

- instant: record index
- dteday : date
- season : season (1:winter, 2:spring, 3:summer, 4:fall)
- yr : year (0: 2011, 1:2012)
- mnth : month ( 1 to 12)
- hr : hour (0 to 23)
- holiday : weather day is holiday or not (extracted from [Web Link])
- weekday : day of the week
- workingday : if day is neither weekend nor holiday is 1, otherwise is 0.
+ weathersit :
- 1: Clear, Few clouds, Partly cloudy, Partly cloudy
- 2: Mist + Cloudy, Mist + Broken clouds, Mist + Few clouds, Mist
- 3: Light Snow, Light Rain + Thunderstorm + Scattered clouds, Light Rain + Scattered clouds
- 4: Heavy Rain + Ice Pallets + Thunderstorm + Mist, Snow + Fog
- temp : Normalized temperature in Celsius. The values are derived via (t-t_min)/(t_max-t_min), t_min=-8, t_max=+39 (only in hourly scale)
- atemp: Normalized feeling temperature in Celsius. The values are derived via (t-t_min)/(t_max-t_min), t_min=-16, t_max=+50 (only in hourly scale)
- hum: Normalized humidity. The values are divided to 100 (max)
- windspeed: Normalized wind speed. The values are divided to 67 (max)
- casual: count of casual users
- registered: count of registered users
- cnt: count of total rental bikes including both casual and registered

In [46]:
import pandas as pd
import numpy as np

- Import the dataset
- Explore the dataset
- Cleaning if needed
- Grouping
- Export the results

In [47]:
data = pd.read_csv("bike_shairing_hourly.csv")
data.head()

,instant,dteday,season,yr,mnth,hr,holiday,weekday,workingday,weathersit,temp,atemp,hum,windspeed,casual,registered,cnt
0,1,2011-01-01,1,0,1,0,0,6,0,1,0.24,0.2879,0.81,0.0,3,13,16
1,2,2011-01-01,1,0,1,1,0,6,0,1,0.22,0.2727,0.80,0.0,8,32,40
2,3,2011-01-01,1,0,1,2,0,6,0,1,0.22,0.2727,0.80,0.0,5,27,32
3,4,2011-01-01,1,0,1,3,0,6,0,1,0.24,0.2879,0.75,0.0,3,10,13
4,5,2011-01-01,1,0,1,4,0,6,0,1,0.24,0.2879,0.75,0.0,0,1,1

In [48]:
data.tail()

,instant,dteday,season,yr,mnth,hr,holiday,weekday,workingday,weathersit,temp,atemp,hum,windspeed,casual,registered,cnt
17374,17375,2012-12-31,1,1,12,19,0,1,1,2,0.26,0.2576,0.60,0.1642,11,108,119
17375,17376,2012-12-31,1,1,12,20,0,1,1,2,0.26,0.2576,0.60,0.1642,8,81,89
17376,17377,2012-12-31,1,1,12,21,0,1,1,1,0.26,0.2576,0.60,0.1642,7,83,90
17377,17378,2012-12-31,1,1,12,22,0,1,1,1,0.26,0.2727,0.56,0.1343,13,48,61
17378,17379,2012-12-31,1,1,12,23,0,1,1,1,0.26,0.2727,0.65,0.1343,12,37,49

In [49]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17379 entries, 0 to 17378
Data columns (total 17 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   instant     17379 non-null  int64
 1   dteday      17379 non-null  object
 2   season      17379 non-null  int64
 3   yr          17379 non-null  int64
 4   mnth        17379 non-null  int64
 5   hr          17379 non-null  int64
 6   holiday     17379 non-null  int64
 7   weekday     17379 non-null  int64
 8   workingday  17379 non-null  int64
 9   weathersit  17379 non-null  int64
 10  temp        17379 non-null  float64
 11  atemp       17379 non-null  float64
 12  hum         17379 non-null  float64
 13  windspeed   17379 non-null  float64
 14  casual      17379 non-null  int64
 15  registered  17379 non-null  int64
 16  cnt         17379 non-null  int64
dtypes: float64(4), int64(12), object(1)
memory usage: 2.3+ MB

In [50]:
data.shape

(17379, 17)

In [51]:
data.columns

Index(['instant', 'dteday', 'season', 'yr', 'mnth', 'hr', 'holiday', 'weekday',
       'workingday', 'weathersit', 'temp', 'atemp', 'hum', 'windspeed',
       'casual', 'registered', 'cnt'],
      dtype='object')

In [52]:
type(data)

pandas.core.frame.DataFrame

In [54]:
data.dtypes

instant         int64
dteday         object
season          int64
yr              int64
mnth            int64
hr              int64
holiday         int64
weekday         int64
workingday      int64
weathersit      int64
temp          float64
atemp         float64
hum           float64
windspeed     float64
casual          int64
registered      int64
cnt             int64
dtype: object

In [55]:
data.describe()

,instant,season,yr,mnth,hr,holiday,weekday,workingday,weathersit,temp,atemp,hum,windspeed,casual,registered,cnt
count,17379.0000,17379.000000,17379.000000,17379.000000,17379.000000,17379.000000,17379.000000,17379.000000,17379.000000,17379.000000,17379.000000,17379.000000,17379.000000,17379.000000,17379.000000,17379.000000
mean,8690.0000,2.501640,0.502561,6.537775,11.546752,0.028770,3.003683,0.682721,1.425283,0.496987,0.475775,0.627229,0.190098,35.676218,153.786869,189.463088
std,5017.0295,1.106918,0.500008,3.438776,6.914405,0.167165,2.005771,0.465431,0.639357,0.192556,0.171850,0.192930,0.122340,49.305030,151.357286,181.387599
min,1.0000,1.000000,0.000000,1.000000,0.000000,0.000000,0.000000,0.000000,1.000000,0.020000,0.000000,0.000000,0.000000,0.000000,0.000000,1.000000
25%,4345.5000,2.000000,0.000000,4.000000,6.000000,0.000000,1.000000,0.000000,1.000000,0.340000,0.333300,0.480000,0.104500,4.000000,34.000000,40.000000
50%,8690.0000,3.000000,1.000000,7.000000,12.000000,0.000000,3.000000,1.000000,1.000000,0.500000,0.484800,0.630000,0.194000,17.000000,115.000000,142.000000
75%,13034.5000,3.000000,1.000000,10.000000,18.000000,0.000000,5.000000,1.000000,2.000000,0.660000,0.621200,0.780000,0.253700,48.000000,220.000000,281.000000
max,17379.0000,4.000000,1.000000,12.000000,23.000000,1.000000,6.000000,1.000000,4.000000,1.000000,1.000000,1.000000,0.850700,367.000000,886.000000,977.000000

In [56]:
data.season.describe()

count    17379.000000
mean         2.501640
std          1.106918
min          1.000000
25%          2.000000
50%          3.000000
75%          3.000000
max          4.000000
Name: season, dtype: float64

<b>Clean if needed

In [58]:
data.instant.unique()

array([    1,     2,     3, ..., 17377, 17378, 17379], dtype=int64)

In [59]:
data.season.unique

<bound method Series.unique of 0        1
1        1
2        1
3        1
4        1
        ..
17374    1
17375    1
17376    1
17377    1
17378    1
Name: season, Length: 17379, dtype: int64>

In [60]:
data.season.unique()

array([1, 2, 3, 4], dtype=int64)

In [61]:
data['mnth'].unique()

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12], dtype=int64)

You can use the pd.NaT, np.NaN or None to denote the missing values in the dataframe.

In [62]:
data.isnull()

,instant,dteday,season,yr,mnth,hr,holiday,weekday,workingday,weathersit,temp,atemp,hum,windspeed,casual,registered,cnt
0,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
17374,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
17375,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
17376,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
17377,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
17378,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False

In [63]:
data.isnull().sum()

instant       0
dteday        0
season        0
yr            0
mnth          0
hr            0
holiday       0
weekday       0
workingday    0
weathersit    0
temp          0
atemp         0
hum           0
windspeed     0
casual        0
registered    0
cnt           0
dtype: int64

In [64]:
data.isna().sum()

instant       0
dteday        0
season        0
yr            0
mnth          0
hr            0
holiday       0
weekday       0
workingday    0
weathersit    0
temp          0
atemp         0
hum           0
windspeed     0
casual        0
registered    0
cnt           0
dtype: int64

In [67]:
data.duplicated().sum()

0

In [69]:
data.instant.duplicated().sum()

0

In [71]:
data.dteday.duplicated().sum()

16648

In [72]:
#Extract year from dteday amd merge with dataframe

In [109]:
type(data.dteday.dtype)

numpy.dtype[object_]

In [115]:
year1 = pd.to_datetime(data.dteday)
print(type(year1))
print(year1.dtype)

<class 'pandas.core.series.Series'>
datetime64[ns]

In [118]:
y = year1.dt.year

In [119]:
type(y)

pandas.core.series.Series

In [120]:
data.columns

Index(['instant', 'dteday', 'season', 'yr', 'mnth', 'hr', 'holiday', 'weekday',
       'workingday', 'weathersit', 'temp', 'atemp', 'hum', 'windspeed',
       'casual', 'registered', 'cnt'],
      dtype='object')

In [122]:
data['new_col_year'] = y

In [124]:
data.head()

,instant,dteday,season,yr,mnth,hr,holiday,weekday,workingday,weathersit,temp,atemp,hum,windspeed,casual,registered,cnt,new_col_year
0,1,2011-01-01,1,0,1,0,0,6,0,1,0.24,0.2879,0.81,0.0,3,13,16,2011
1,2,2011-01-01,1,0,1,1,0,6,0,1,0.22,0.2727,0.80,0.0,8,32,40,2011
2,3,2011-01-01,1,0,1,2,0,6,0,1,0.22,0.2727,0.80,0.0,5,27,32,2011
3,4,2011-01-01,1,0,1,3,0,6,0,1,0.24,0.2879,0.75,0.0,3,10,13,2011
4,5,2011-01-01,1,0,1,4,0,6,0,1,0.24,0.2879,0.75,0.0,0,1,1,2011

In [126]:
#DROP Columns : Way 1
data = data.drop("instant",axis=1) #axis 1 = col
data.head()

#DROP Columns : Way 2
#data.drop("instant",axis=1, inplace=True) #faster than : data = data.drop("instant",axis=1)

,dteday,season,yr,mnth,hr,holiday,weekday,workingday,weathersit,temp,atemp,hum,windspeed,casual,registered,cnt,new_col_year
0,2011-01-01,1,0,1,0,0,6,0,1,0.24,0.2879,0.81,0.0,3,13,16,2011
1,2011-01-01,1,0,1,1,0,6,0,1,0.22,0.2727,0.80,0.0,8,32,40,2011
2,2011-01-01,1,0,1,2,0,6,0,1,0.22,0.2727,0.80,0.0,5,27,32,2011
3,2011-01-01,1,0,1,3,0,6,0,1,0.24,0.2879,0.75,0.0,3,10,13,2011
4,2011-01-01,1,0,1,4,0,6,0,1,0.24,0.2879,0.75,0.0,0,1,1,2011

<b>GROUPING

In [128]:
#In which season is the bike rental max?
data.head(3)

,dteday,season,yr,mnth,hr,holiday,weekday,workingday,weathersit,temp,atemp,hum,windspeed,casual,registered,cnt,new_col_year
0,2011-01-01,1,0,1,0,0,6,0,1,0.24,0.2879,0.81,0.0,3,13,16,2011
1,2011-01-01,1,0,1,1,0,6,0,1,0.22,0.2727,0.80,0.0,8,32,40,2011
2,2011-01-01,1,0,1,2,0,6,0,1,0.22,0.2727,0.80,0.0,5,27,32,2011

In [132]:
gb_season = data.groupby('season')
print(type(gb_season))

<class 'pandas.core.groupby.generic.DataFrameGroupBy'>

In [131]:
gb_season

In [ ]:
#Difference between sum and count
# Take casual column
# Sum = 3+8+5
# Count = 3

In [133]:
gb_season.sum()

,yr,mnth,hr,holiday,weekday,workingday,weathersit,temp,atemp,hum,windspeed,casual,registered,cnt,new_col_year
season,,,,,,,,,,,,,,,
1,2174,13234,49413,164,12763,2794,6194,1268.98,1264.6101,2466.08,912.4850,60622,410726,471348,8532836
2,2206,20520,50757,96,13190,3066,6365,2401.42,2295.0915,2764.54,896.8359,203522,715067,918589,8868705
3,2256,34573,51738,96,13637,3141,5981,3176.02,2949.3918,2846.72,771.4810,226091,835038,1061129,9043712
4,2098,45293,48763,144,12611,2864,6230,1790.72,1759.4021,2823.27,722.9044,129782,711831,841613,8512650

In [134]:
gb_season.casual.sum()

season
1     60622
2    203522
3    226091
4    129782
Name: casual, dtype: int64

In [136]:
casual_series = gb_season['casual'].sum()
casual_series

season
1     60622
2    203522
3    226091
4    129782
Name: casual, dtype: int64

In [138]:
registered_series = gb_season.registered.sum()
registered_series

season
1    410726
2    715067
3    835038
4    711831
Name: registered, dtype: int64

In [142]:
#Creating dataFrame with groupped columns : WAY1 

list = [casual_series, registered_series]
data2 = pd.DataFrame(list)
data2.T

        casual  registered
season
1        60622      410726
2       203522      715067
3       226091      835038
4       129782      711831

In [145]:
#Creating dataFrame with groupped columns : WAY2

#Concatenate
#Concatenate will take series as an input
data3 = pd.concat(list) #Here axis = 0, therefore concatenated one after another

season
1     60622
2    203522
3    226091
4    129782
1    410726
2    715067
3    835038
4    711831
dtype: int64

In [149]:
data3 = pd.concat(list, axis=1)
data3

        casual  registered
season
1        60622      410726
2       203522      715067
3       226091      835038
4       129782      711831

In [152]:
#Way 1 for sum of casual and registered
data3['sum'] = data3.sum(axis=1)

In [153]:
data3

        casual  registered      sum
season
1        60622      410726   471348
2       203522      715067   918589
3       226091      835038  1061129
4       129782      711831   841613

In [154]:
#Way 2 for sum of casual and registered
data3['total'] = data3.casual + data3.registered
data3

        casual  registered      sum    total
season
1        60622      410726   471348   471348
2       203522      715067   918589   918589
3       226091      835038  1061129  1061129
4       129782      711831   841613   841613

In [156]:
data3.to_csv("Results.csv")

<b>MERGING TWO DATAFRAMES

In [164]:
df1 = pd.DataFrame(casual_series) #casual_series decalred above
df2 = pd.DataFrame(registered_series)

print(df1)
print(df2)

        casual
season
1        60622
2       203522
3       226091
4       129782
        registered
season
1           410726
2           715067
3           835038
4           711831

In [165]:
df_merged = pd.merge(df1, df2, on="season")
df_merged

        casual  registered
season
1        60622      410726
2       203522      715067
3       226091      835038
4       129782      711831

In [ ]:
#Try to merge df's of different shapes
#chunking